package homework4;

//```Цель: Практика создания обобщенных классов и методов для обработки различных типов данных.
//
//        Инструкции:
//
//        Создайте обобщенный класс Box, который будет представлять собой коробку, способную хранить объекты разных типов.
//        Класс Box должен иметь поле для хранения объекта и соответствующие геттеры и сеттеры.
//
//        Создайте метод printBoxContents, который принимает объект класса Box и выводит на экран содержимое этой коробки.
//        Обратите внимание, что этот метод должен работать с любым типом объекта, хранящегося в Box.
//        Используйте обобщенные методы для достижения этой цели.
//
//        Создайте еще один обобщенный класс Pair, который будет представлять собой пару объектов.
//        Этот класс должен иметь два поля для хранения объектов и соответствующие геттеры и сеттеры.
//
//        Создайте метод swapPairs, который принимает массив объектов типа Pair и меняет местами элементы в каждой паре.
//        Например, если у вас есть пара (A, B), после вызова swapPairs она должна стать парой (B, A).
//        Используйте обобщенные методы для реализации этой операции.
//
//        Напишите программу, которая демонстрирует использование вашего обобщенного класса Box
//        и методов printBoxContents и swapPairs для разных типов данных
//        (например, целых чисел, строк, объектов пользовательских классов и т. д.).
//
//        Выведите результаты выполнения программы на экран, чтобы показать, что методы работают с разными типами данных.
//
//        Примечания:
//
//        Обязательно добавьте комментарии к вашему коду, чтобы объяснить, к
//        акие части кода выполняют какие задачи и как обобщенные типы используются в вашей программе.
//
//        При реализации метода swapPairs, учтите, что он должен работать с любыми типами объектов внутри пары.
//
//        Экспериментируйте с разными типами данных, чтобы продемонстрировать универсальность вашего кода.
//
//        Удачи в выполнении задания!


public class Main {

    public static void main(String[] args) {

        Box<String> box1 = new Box<String>("Nothing!");
        Box<Integer> box2 = new Box<Integer>(807);

        Box.printBoxContents(box1); //Nothing!
        Box.printBoxContents(box2); //807

        System.out.println("---------------");
        System.out.println("---------------");

        Pair<Integer,String> pair1 = new Pair<>(10,"what");
        Pair<Double,Character> pair2 = new Pair<>(5.3,'u');

        Pair<?, ?>[] pairs = {pair1, pair2};
        for (Pair<?,?> p : pairs) {
            System.out.println("First element in "+ p +": " + p.getFirstPair() +"  Class:  " + p.getFirstPair().getClass());
            System.out.println("First element in "+ p +": " + p.getSecondPair()+"  Class:  " +p.getSecondPair().getClass());
        }
        Pair.swapPairs(pairs);
        System.out.println("---------------");
        for (Pair<?,?> p : pairs) {
            System.out.println("First element in "+ p +": " + p.getFirstPair() +"  Class:  " + p.getFirstPair().getClass());
            System.out.println("First element in "+ p +": " + p.getSecondPair()+"  Class:  " +p.getSecondPair().getClass());
        }
    }

}
